Public Attributes | List of all members
API_FilltypeType Struct Reference
Attribute Management
Fill type attribute representation. More...
#include <APIdefs_Attributes.h>
 Public Attributes
 API_Attr_Head  | head
Contains the name and the index of the fill. The flags field tells whether the fill is for drafting, cover, or cut fills, and scales with the plan or scale-independent.
 API_FillSubtype  | subType
Describes the type of the fill. The possible values are enumerated in API_FillSubtype .
 bool  | isPercentFill
Indicates a "percent" fill, e.g. 100%, 75%. This is an output-only parameter; detected from the bitmap pattern.
 API_Pattern  | bitPat
Pattern of the fill. It is an eight-character constant; the first character corresponds to the the first line of the pattern, the second character to the second, etc. Example: the bitPat 0x8080808F888888F8 means the following pattern: 0x80 *----—.
 double  | hXSpac
The fill's spacing factor in the X direction.
 double  | hYSpac
The fill's spacing factor in the Y direction.
 double  | hAngle
The angle of the fill.
 Int32  | linNumb
The number of fill line items.
 Int32  | hotNumb
The number of hotspot items (symbol fill only).
 Int32  | arcNumb
The number of arc items (symbol fill only).
 Int32  | filNumb
The number of simple fill items (symbol fill only).
 API_Coord  | c1
The symbol fill offset. Corresponds to the X1, Y1 values in the Fill Types dialog.
 API_Coord  | c2
The symbol fill offset. Corresponds to the X2, Y2 values in the Fill Types dialog.
 GS::uchar_t  | textureName [API_UniLongNameLen]
The name of the texture file.
 short  | textureStatus
Texture status: APITxtr_MirrorY | APITxtr_MirrorX .
 double  | textureXSize
The horizontal (x) size of the texture.
 double  | textureYSize
The vertical (y) size of the texture.
 double  | textureRotAng
The rotation angle of the texture in radians.
 double  | percent
Percent of the translucent fill.
Detailed Description
Fill type attribute representation.
Remarks
The flags field of the header can take the following values:
 Value  | Description
 APIFill_ScaleWithPlan  | The fill type is scale dependent.
 APIFill_ForWall  | This fill can be used for cut fills.
 APIFill_ForPoly  | This fill can be used for drafting fills.
 APIFill_ForCover  | This fill can be used for cover fills.
 The subType of the fill can take the following values:
 Value  | Description
 APIFill_Vector  | Vectorial fill.
 APIFill_Symbol  | Symbol fill.
 APIFill_Solid  | Solid fill. Only one solid fill may exist for polygons, and one for walls.
 APIFill_Empty  | Empty fill. Only one empty fill may exist for polygons, and one for walls.
 APIFill_LinearGradient  | Linear gradient fill.
 APIFill_RadialGradient  | Radial gradient fill.
 APIFill_Image  | Image fill.
 Most of the fields in this structure correspond to the items of the Fill Types dialog in Archicad. There is additional data assigned to fill attributes in the API_AttributeDef structure; the definition of a fill is passed through the fill_lineItems and fill_lineLength fields. Refer to the API_FillLine structure to get more details on them. Note that in AC17 the Energy Evaluation property parameters (thermalConductivity, density and heatCapacity) have been removed from this structure; they are now part of API_BuildingMaterialType.